# InCanvasControlData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InCanvasControlData Properties
InCanvasControlData Class See Also
---
The InCanvasControlData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ImagePath | The path to the image file to be used. This must be an absolute path to a location on disk. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Position | The position of the in-canvas control in model coordinates. |

# See Also
InCanvasControlData Class
Autodesk.Revit.DB Namespace